Revit 2027 API
InsertOrientation Enumeration
 The allowed values for the INSERT_ORIENTATION parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum InsertOrientation
Public Enumeration InsertOrientation
public enum class InsertOrientation
type InsertOrientation
Members
Member name | Value | Description
Exterior | 2 |  Insert is aligned with the Tapered wall's exterior face.
Interior | 3 |  Insert is aligned with the Tapered wall's interior face.
Slanted | 1 |  Insert is aligned with the Slanted wall's slant direction.
Vertical | 0 |  Insert is vertical regardless of the wall's slant.
See Also
Reference
Autodesk.Revit.DB Namespace